Catalogs/ПодпискиНаОчередиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодпискиНаОчередиСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОжиданияСобытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Асинхронно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодпискиНаОчередиСообщений/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Процедура СоздатьИОбновитьПодпискиНаОчереди() Экспорт 
	
	Обработчики = ПолучениеСообщенийСлужебный.ПолучитьКоллекциюРегистрацииОбработчиков();
	ПолучениеСообщенийПереопределяемый.ПриРегистрацииОбработчиковСообщений(Обработчики);
	СоздатьПодпискиНаОчереди(Обработчики, Ложь);
	
	Обработчики = ПолучениеСообщенийСлужебный.ПолучитьКоллекциюРегистрацииОбработчиков();
	ПолучениеСообщенийПереопределяемый.ПриРегистрацииОбработчиковСообщенийАсинх(Обработчики);
	СоздатьПодпискиНаОчереди(Обработчики, Истина);
	
КонецПроцедуры

Функция СоздатьПодпискиНаОчереди(Обработчики, Асинхронно = Ложь)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодпискиНаОчередиСообщений.ИмяОчереди КАК ИмяОчереди
	|ИЗ
	|	Справочник.ПодпискиНаОчередиСообщений КАК ПодпискиНаОчередиСообщений
	|ГДЕ
	|	ПодпискиНаОчередиСообщений.ПометкаУдаления = ЛОЖЬ";
	
	ОчередиСПодписками = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОчередиСПодписками[Выборка.ИмяОчереди] = Истина;
	КонецЦикла;
	
	Для Каждого Обработчик Из Обработчики Цикл
		
		Если ОчередиСПодписками[Обработчик.Ключ] = Неопределено Тогда
			
			Подписка = Справочники.ПодпискиНаОчередиСообщений.СоздатьЭлемент();
			Подписка.Наименование = Обработчик.Ключ;
			Подписка.ИмяОчереди = Обработчик.Ключ;
			Подписка.Активно = Истина;
			Подписка.ИнтервалОжиданияСобытия = 10;
			Подписка.Асинхронно = Асинхронно;
						
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораДней = 1;
			Расписание.ПериодПовтораВТечениеДня = 30;
			Если Асинхронно = Истина Тогда 
				Расписание.ПаузаПовтора = 3;
		    КонецЕсли;
			Подписка.РасписаниеЗадания = Новый ХранилищеЗначения(Расписание);
			
			Подписка.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецЕсли
